; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	infrared0 - mode
	thermograph1 - mode
	spectrograph4 - mode
	thermograph3 - mode
	Star3 - direction
	Star4 - direction
	Star2 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation0 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star5)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 thermograph1)
	(have_image Phenomenon9 spectrograph4)
	(have_image Planet10 thermograph3)
	(have_image Planet11 infrared0)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 spectrograph2)
	(have_image Star14 spectrograph2)
	(have_image Star15 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star6)
   goals met: 0 of 10
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 10
3. (calibrate satellite1 instrument4 star6)
   added: (calibrated instrument4)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon9 instrument4 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 10
7. (turn_to satellite0 groundstation1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 10
8. (take_image satellite1 phenomenon13 instrument4 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 10
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 10
10. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 10
11. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 10
12. (take_image satellite0 phenomenon8 instrument2 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 10
13. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 3 of 10
14. (take_image satellite0 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 10
15. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 4 of 10
16. (take_image satellite0 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 5 of 10
17. (turn_to satellite0 star14 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star14)
   goals met: 6 of 10
18. (turn_to satellite1 planet10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet10)
   goals met: 6 of 10
19. (take_image satellite1 planet10 instrument4 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 7 of 10
20. (turn_to satellite1 star12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star12)
   goals met: 7 of 10
21. (take_image satellite1 star12 instrument4 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 8 of 10
22. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 8 of 10
23. (take_image satellite1 star14 instrument4 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 9 of 10
24. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 9 of 10
25. (take_image satellite1 star15 instrument4 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 10 of 10
